Revit 2026 API
IExternalCommandAvailability Interface
An interface that should be implemented to provide the implementation for a accessibility check for a Revit add-in External Command.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public interface IExternalCommandAvailability
Public Interface IExternalCommandAvailability
public interface class IExternalCommandAvailability
type IExternalCommandAvailability = interface end
The IExternalCommandAvailability type exposes the following members.
Methods
Name | Description
IsCommandAvailable |  Implement this method to provide control over whether your external command is enabled or disabled.
Top
Remarks
This interface should share the same assembly with add-in External Command.
See Also
Reference
Autodesk.Revit.UI Namespace